# CSV file

# Create dataframe

In [1]:

names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

To merge these two lists together we will use the zip function.

In [2]:
BabyDataSet = list(zip(names,births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [19]:
import pandas as pd
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

# Export the dataframe to a csv file.

The function to_csv will be used to export the file. The file will be saved in the same location of the notebook unless specified otherwise.

In [20]:
df.to_csv('births.csv',index=False,header=False)

# Get Data

To pull in the csv file, use the pandas function read_csv.

Even though this functions has many parameters, we will simply pass it the location of the text file.

Location = "C:\Users\i life\Desktop\python basics\births1881.csv"

Note: Depending on where you save your notebooks, you may need to modify the location above.

In [21]:
Location = "C:/Users/i life/Desktop/python basics/births.csv"
df = pd.read_csv(Location)

In [22]:
df

       Bob  968
0  Jessica  155
1     Mary   77
2     John  578
3      Mel  973

 - The read_csv function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names.

 - To correct this just pass the header parameter to the read_csv function and set it to None (means null in python).

In [23]:
df = pd.read_csv(Location, header=None)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

- If we wanted to give the columns specific names, we would have to pass another parameter called names. We can also omit the header parameter.

In [24]:
df = pd.read_csv(Location, names=['Names','Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

# Zip file

In [36]:
import pandas as pd
import zipfile

zf = zipfile.ZipFile('C:/Users/i life/Downloads/Data_Preprocessing.zip') 
df = pd.read_csv(zf.open(zipfile.ZipFile.namelist(zf)[3])) 

#Provided there should be only one file in the zipfile without nested folders.

In [37]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes